import { MessageProps } from '@/ui';

export const messages: MessageProps[] = [
  {
    user: {
      id: 'w2kmsko31wdsa',
      name: 'Alexandr',
    },
    text:
      'Каждый работает сам по себе, и когда надо отправляет данные другому. Отправил — и пошел дальше, ничего ждать не надо',
    date: new Date('02.02.2020 20:00'),
    isOwner: true,
    isRead: true,
  },
  {
    user: {
      id: 'w2kmsko31wdsa',
      name: 'Sam',
    },
    text:
      'Каждый работает сам по себе, и когда надо отправляет данные другому. Отправил — и пошел дальше, ничего ждать не надо',
    date: new Date('02.02.2020 20:00'),
  },
  {
    user: {
      id: 'w2kmsko31wdsa',
      name: 'Alexandr',
    },
    text:
      'Каждый работает сам по себе, и когда надо отправляет данные другому. Отправил — и пошел дальше, ничего ждать не надо',
    date: new Date('02.02.2020 20:00'),
    isOwner: true,
    isRead: true,
  },
  {
    user: {
      id: 'w2kmsko31wdsa',
      name: 'Sam',
    },
    text:
      'Каждый работает сам по себе, и когда надо отправляет данные другому. Отправил — и пошел дальше, ничего ждать не надо',
    date: new Date('02.02.2020 20:00'),
  },
  {
    user: {
      id: 'w2kmsko31wdsa',
      name: 'Alexandr',
    },
    text:
      'Каждый работает сам по себе, и когда надо отправляет данные другому. Отправил — и пошел дальше, ничего ждать не надо',
    date: new Date('02.02.2020 20:00'),
    isOwner: true,
    isRead: true,
  },
  {
    user: {
      id: 'w2kmsko31wdsa',
      name: 'Sam',
    },
    text:
      'Каждый работает сам по себе, и когда надо отправляет данные другому. Отправил — и пошел дальше, ничего ждать не надо',
    date: new Date('02.02.2020 20:00'),
  },
  {
    user: {
      id: 'w2kmsko31wdsa',
      name: 'Alexandr',
    },
    text:
      'Каждый работает сам по себе, и когда надо отправляет данные другому. Отправил — и пошел дальше, ничего ждать не надо',
    date: new Date('02.02.2020 20:00'),
    isOwner: true,
    isRead: true,
  },
  {
    user: {
      id: 'w2kmsko31wdsa',
      name: 'Sam',
    },
    text:
      'Каждый работает сам по себе, и когда надо отправляет данные другому. Отправил — и пошел дальше, ничего ждать не надо',
    date: new Date('02.02.2020 20:00'),
  },
  {
    user: {
      id: 'w2kmsko31wdsa',
      name: 'Alexandr',
    },
    text:
      'Каждый работает сам по себе, и когда надо отправляет данные другому. Отправил — и пошел дальше, ничего ждать не надо',
    date: new Date('02.02.2020 20:00'),
    isOwner: true,
  },
];
